tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;

chemistryReader foamChemistryReader;

foamChemistryThermoFile "$FOAM_CASE/chemkin/foam.dat";

foamChemistryFile "$FOAM_CASE/chemkin/foam.inp";

inertSpecie     N2;

liquidComponents
(
    H2O
);

H2O             H2O defaultCoeffs;

solidComponents
(
    C
    ash
);

C               C defaultCoeffs;

ash             ash defaultCoeffs;


// ************************************************************************* //
